#+INCLUDE: ../+layouts/header.org
#+TITLE: Spacemacs Configuration

** Setup
To use this configuration, you would need to download the following ~*.el~ file in
the correct path as well as update the ~init.el~ file as describe below:

| *Location* | ~~/.spacemacs.d/c-c++config.el~ |
| *Link*     | [[https://www.google.com/][c-c++config.el]]                |

Add ~(load "c-c++config")~ to the ~dotspacemacs/user-config~ section of your
dotfile.

*Example:*

#+begin_src emacs-lisp
  (defun dotspacemacs/user-config ()
   "Configuration for user code:
  This function is called at the very end of Spacemacs startup, after layer
  configuration.
  Put your configuration code here, except for variables that should be set
  before packages are loaded."

     ;; Load the directory for custom spacemacs config files.
     (push "~/.spacemacs.d/" load-path)

     (load "c-c++config")

   ;; rest of the code
   )
#+end_src

And the ~~/.spacemacs.d~ directory should look something like this:

#+begin_src sh :exports results :results value scalar
  tree ~/SPACE.d
#+end_src

#+RESULTS:
: /home/imahajanshubham/SPACE.d
: ├── generalconfig.el
: └── init.el
: 
: 0 directories, 2 files

* Summary
If you have used all the config files, then the ~~/.spacemacs.d~ directory should
finally look something like this:

#+begin_src sh :exports both :results value scalar
  tree ~/SPACE.d
#+end_src

#+RESULTS:
#+begin_example
/home/imahajanshubham/SPACE.d
├── c-c++config.el
├── flycheckconfig.el
├── flyspellconfig.el
├── generalconfig.el
├── init.el
├── javaconfig.el
├── layoutsconfig.el
├── miscconfig.el
├── mu4econfig.el
├── orgconfig.el
├── plantumlconfig.el
├── pythonconfig.el
├── shellconfig.el
└── sqlconfig.el

0 directories, 14 files
#+end_example

